app/Http/Controllers/DashboardController.php

select `questions`.*, (select sum(`votes`.`like`) from `votes` where `questions`.`id` = `votes`.`question_id`) as `votes_sum_like`, (select sum(`votes`.`unlike`) from `votes` where `questions`.`id` = `votes`.`question_id`) as `votes_sum_unlike` from `questions` limit 5 offset 0
select count(*) as aggregate from `questions`
---
    public function __invoke(): View
    {

        return view('dashboard', [
            'questions' => Question::query()
                ->withSum('votes', 'like')
                ->withSum('votes', 'unlike')
                ->orderByRaw('
                    case when votes_sum_like is null then 0 else votes_sum_like end desc,
                    case when votes_sum_unlike is null then 0 else votes_sum_unlike end
                ')
                ->paginate(5),
        ]);