app/Http/Controllers/QuestionController.php

insert into `questions` (`question`, `draft`, `created_by`, `updated_at`, `created_at`) values ('testar mais perguntas?', 1, 1, '2023-11-16 01:53:04', '2023-11-16 01:53:04')
---
                function (string $attribute, mixed $value, Closure $fail) { // Custom Validation Rules conforme doc laravel Using Closures
                    if ($value[strlen($value) - 1] != '?') { // se o ultimo ch for diferente de ?
                        $fail('Are you sure that is a question? It is missing the question mark in the end.'); // vai mostrar essa mensagem
                    }
                },
            ],
        ]);

        // do meu model criar uma query, criar um registro que vai receber o question e vai ter o request()->validate(question) através do $attributes
        Question::query()
            ->create([
                'question' => request()->question,
                'draft'    => true,
            ]);