app/Models/User.php

insert into `votes` (`question_id`, `like`, `unlike`, `user_id`, `updated_at`, `created_at`) values (1, 1, 0, 1, '2023-11-09 19:07:32', '2023-11-09 19:07:32')
select * from `votes` where `votes`.`user_id` = 1 and `votes`.`user_id` is not null and (`question_id` = 1) limit 1
---
    public function like(Question $question): void // return void
    {
        $this->votes()->updateOrCreate(
            [ // com o metódo vote avisando que tem muitas votações, não precisa passar o user_id
                'question_id' => $question->id,
            ],
            [
                'like'   => 1,
                'unlike' => 0,
            ]
        );

select * from `votes` where `votes`.`user_id` = 1 and `votes`.`user_id` is not null and (`question_id` = 1) limit 1
---
    public function unlike(Question $question): void
    {
        $this->votes()->updateOrCreate(
            [ // com o metódo vote avisando que tem muitas votações, não precisa passar o user_id
                'question_id' => $question->id,
            ],
            [
                'like'   => 0,
                'unlike' => 1,
            ]
        );